openFoam-heat-exchanger/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    tube_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       1831;
    }
    tube_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       1838;
    }
    shell_wall
    {
        type            patch;
        physicalType    patch;
        nFaces          240;
        startFace       1845;
    }
    shell_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       2085;
    }
    shell_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       2145;
    }
)

// ************************************************************************* //
